Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: If you are already an OBS user and have experienced the WebUI as well as its command-line client and are looking on how you can deploy your own OBS instance then the third paper of the series [2] will provide you with information and step-by-step instructions.
ja: すでに OBS のユーザーで、WebUI やコマンドライン クライアントも経験し、自分の OBS インスタンスのデプロイ方法を検討している方は、このシリーズの第三弾 [2] に掲載されている関連情報と詳細手順をご覧ください。

source: Prior to distributing a collection of software, the contents of each package to be included need to be reviewed to ensure compliance with all the licenses in the code being redistributed.
ja: ソフトウェア群を配布する前に、組み込まれる各パッケージの内容をレビューし、再配布されるコードのすべてのライセンスを確実に順守する必要がある。

source: If you are a compliance officer, please click here to be added to the directory.
ja: コンプライアンス オフィサー (担当者) の方は、こちらにアクセスし、ディレクトリ (担当者名簿) に登録してください。

source: h)The OSRB decides whether to approve the proposed OSS use and identifies obligations that must be satisfied, if any, and conditions that must be met, if any, before product distribution is approved.
ja: h) OSRB は、提出された OSS の使用を承認するかどうか決定し、履行すべき義務があれば特定し、満たすべき条件があれば特定した上で、最後に製品の出荷を承認する。

source: The MeeGo OBS
ja: MeeGo OBS

source: Self-Assessment Compliance Checklist
ja: コンプライアンス自己診断チェックリスト

source: Using the public interface (e.g. https://api.opensuse.org/public) which allows access as an anonymous user.
ja: 匿名ユーザーとしてアクセス可能なパブリック インタフェース (https://api.opensuse.org/public など) を使用する。

source: Bill of Material (BoM) Difference Checker, capable of reporting differences between bills of material.
ja: BoM (構成表) の差分を報告する BoM 比較 (Bill of Material (BoM) Difference Checker) ツール。

source: Developers quickly started to extend the make process with pre- and post-processing such as checking-out source files from repositories, calling external tools for packaging, deploying objects to targets etc.
ja: 開発者らは、迅速に make プロセスを拡張し始め、リポジトリにあるソース ファイルのチェック アウト、パッケージング用の外部ツールの呼び出し、ターゲットへのオブジェクトのデプロイなどの前後処理を追加しました。

source: But software re-use has created additional wrinkles.
ja: しかしソフトウェアの再利用は、新たな問題を招いています。

source: The documentation team is responsible for ensuring the inclusion of a written offer to provide source code for included FOSS and that appropriate notices (copyrights and attributions) are included in the product documentation.
ja: ドキュメンテーション チームは、組み込まれている FOSS のソース コードを提供するための "書面によるオファー"、および適切な告知 (著作権告知や帰属告知など) が、確実に製品ドキュメントに含まれるよう保証する責任を負います。

source: In this paper, we provided a detailed review of an end-to-end compliance process and illustrated the various compliance steps or phases that FOSS or software components containing FOSS go through before they get approved for use in a product intended for external distribution.
ja: このホワイトペーパーでは、コンプライアンス プロセスの詳細レビューを行い、FOSS および FOSS を含むソフトウェアコンポーネントが、自社製品への使用承認を受ける前に通過するさまざまなコンプライアンス ステップとフェーズを解説しました。

source: - All source code comments have been reviewed and any offending or inappropriate comment has been removed
ja: ソース コードのすべてのコメントが調査され、不適切なコメントがすべて削除されていること。

source: FOSSology plans continue to evolve and they are published on http://fossology.org/task_list.
ja: FOSSology は継続的な機能向上に取り組んでおり、http://fossology.org/task_list で公開されています。

source: This document is intended to describe how the UEFI secure boot specification can be implemented to interoperate well with open systems and to avoid adversely affecting the rights of the owners of those systems while providing compliance with proprietary software vendors' requirements.
ja: このホワイトペーパーでは、オープン システムにおいて、システムのオーナーの権利に悪影響を与えず、しかもプロプライエタリ ソフトウェア ベンダーの要件を満たしながら、UEFI secure boot の仕様を実装する方法について説明します。

source: One Day
ja: 1 日

source: Policies and Processes
ja: ポリシーとプロセス

source: - Ensure that all the pre-distribution verifications have been successfully completed.
ja: 配布前の検証がすべて正常に完了していることの確認

source: The second half of the paper lists the common challenges companies face when establishing and maintaining their compliance programs and proposes various solutions to overcome these challenges.
ja: 後半は、企業がコンプライアンス プログラムを確立および維持する際に直面する一般的な課題を洗い出し、それらの課題を克服するためのさまざまな解決策を提示します。

source: Offer training to engineers to ensure they modify the change logs of software that will be released to the public.
ja: 公開されるソフトウェアの変更記録を技術者が確実に変更するように、技術者を教育する。

source: Mirrors around the globe ensure high availability for everyone.
ja: 世界各地にミラー化されており、誰でも簡単にアクセスすることができます。

source: This will provide the OSRB an early warning of any possible linkage problem.
ja: これにより、OSRB にリンク問題の初期兆候を提供できる。

source: The program also includes free tools to help with compliance due diligence, free education material, comprehensive professional training, an online compliance community (FOSSBazaar) to exchange compliance best practices, the SPDXTM (Software Package Data eXchange) standard for specifying an open source bill of material, and a compliance rapid response directory to help companies and open source developers connect on compliance matters.
ja: このプログラムには、コンプライアンスの精査に役立つ無料ツール、無償の教育資料、専門家による包括的なトレーニング、コンプライアンスのベスト プラクティス (効率的業務プロセス) に関する情報を交換するためのオンライン コンプライアンス コミュニティ (FOSSBazaar)、オープン ソースの構成表 (Bill of Material: BoM) を記入するための SPDX (TM) (Software Package Data eXchange) 標準、および企業やオープン ソース開発者がコンプライアンスの問題について連絡を取り合うためのコンプライアンス緊急対応ディレクトリなどが含まれています。

source: So they are treated as a single binary file instead of a collection of files to be scanned.
ja: このため、それらはスキャン対象のファイル群として認識されず、1 つのバイナリ ファイルとして処理される。

source: The software source code that corresponds to the binaries distributed in the shipping product.
ja: 出荷製品に含まれているバイナリ ファイルに対応するソフトウェア ソース コード。

source: Android Internals
ja: Android Internals (Android 内部構造)

source: Signing binary packages is a recommended procedure to attest the integrity of the package and its source.
ja: バイナリ パッケージに署名することは、パッケージとそのソースの完全性を証明するために有効な手段です。

source: Engineering staff or Product Management is required to inform an Open Source Review Board (OSRB) or compliance team of the intent to use specific FOSS in a specific product or platform release.
ja: 製品やプラットフォームに FOSS を使用する際、技術担当者やプロダクト マネージャーは、オープン ソース調査委員会 (OSRB) やコンプライアンスチームにその旨を通知する必要があります。

source: Continuous enforcement of the basic rules, e.g. engineers must receive approval before integrating a FOSS component in the build system
ja: 基本的なルールの継続的実行。たとえば、エンジニアは FOSS コンポーネントをビルド システムに統合する前に承認を受けなければならないなど。

source: The file is analyzed and the names of the found licenses (or copyrights) are returned, all without touching the FOSSology file repository or database.
ja: FOSSology ファイル リポジトリやデータベースにまったく触れることなく、ファイルが解析され、検出されたライセンスの名前や著作権情報が返されます。

source: The auditing personnel perform a source code scan iteratively from one release to another release label, to build a chain of evidence that what is included in the release is compliant to the various applicable FOSS licenses.
ja: 監査担当者は、リリース ラベルごとにソース コード スキャンを繰り返し実行し、各リリースの内容が、適用される各種の FOSS ライセンスを順守していることを示す証拠チェーンを確立します。

source: Add a verification step into the compliance process to make sure you are publishing the exact version of source code that corresponds to the distributed binary in the product.
ja: コンプライアンス プロセスに検証処理を追加し、製品で配布されるバイナリに対応した正しいバージョンのソース コードを配布しようとしているかどうか確認する。

source: Because of this file naming convention, duplicate files (by contents, not original name) are never stored.
ja: このファイル命名規則のもとでは、同一内容を持つファイルは重複して保存されません。

source: MeeGo Forums http://meego.com/community/forum Pre-Compiled Images http://meego.com/downloads MeeGo Releases http://meego.com/downloads/releases MeeGo SDK http://meego.com/developers/getting-started
ja: MeeGo フォーラム http://meego.com/community/forum プリコンパイル イメージ http://meego.com/downloads MeeGo リリース http://meego.com/downloads/releases MeeGo SDK http://meego.com/developers/getting-started

source: Furthermore, there is the added advantage of verifiable ensured compliance in dealing with OEMs and downstream vendors
ja: さらに OEM や ダウンストリーム ベンダーとの交渉において、検証可能で確実なコンプライアンスが存在するということは大きな利点である

source: The OSRB may decide to issue an approval of broader scope for FOSS components under certain licenses.
ja: OSRB は、特定のライセンスの FOSS コンポーネントに対して広範に承認する場合もあります。

source: O’Reilly’s OSCON offers many embedded Linux sessions.
ja: O'Reilly の OSCON では、各種の組込み Linux セッションを提供しています。

source: Embedded Linux Development
ja: Embedded Linux Development (組込み Linux 開発)

source: Future planned papers will discuss topics such as:
ja: 今後は、以下のようなテーマのホワイトペーパーを予定しています。

source: This failure occurs when employees neglect to take the mandatory FOSS training.
ja: この違反は、従業員が必要な FOSS トレーニングを受講しなかった場合に発生する。

source: All of the projects follow the what either the organization and/or the industry has defined as their best practice.
ja: すべてのプロジェクトは、その組織や業界がベスト プラクティスとして定義したものに従います。

source: Adequate Compliance Staffing
ja: コンプライアンス要員の適正配置

source: Dependency Checker: capable of identifying code combinations at the dynamic and static link level.
ja: Dependency Checker (依存状態チェック ツール): 動的、静的リンク レベルでコードの混在を確認するツールです。

source: Interoperation with Open Systems
ja: オープンシステムにおける動作

source: Participate
ja: 参加者募集

source: With time, companies started to incorporate FOSS into their platforms for the different advantages it offers such as technical merit, fast time-to-market and the ability to customize source code to own needs.
ja: 時が経つにつれ、各企業は、技術的なメリット、製品化時間の短縮、ニーズに合わせたソース コード カスタマイズなどを提求めて、各社のプラットフォームに FOSS を組み込み始めました。

source: Engineering teams prepare the source code packages that will be distributed to source code requests as part of meeting the FOSS license obligations, in addition to any build scripts or utilities needed to build the FOSS that corresponds to the binaries in the software release.
ja: エンジニアリング チームは、FOSS ライセンス義務履行の一環として、ソース コード リクエストに対して配布される ソース コード パッケージを準備します。また、リリースされるソフトウェアのバイナリに対応する FOSS の構築に必要なビルド スクリプトやユーティリティも準備します。

source: In almost all cases, the failure to comply with the FOSS license obligations has also resulted in public embarrassment, negative press and damaged relationships with some of their customers, suppliers and most notably the FOSS community (their software provider) and FOSS organizations.
ja: 通常、FOSS のライセンス義務の不履行は、不名誉や否定的報道を招き、顧客やサプライヤー、特に FOSS コミュニティ (それらのソフトウェアの提供者) や FOSS 組織との関係悪化をもたらします。

source: It then builds the package according to the build configuration.
ja: その後、ビルド コンフィギュレーションに従って、パッケージをビルドします。

source: In the following sections we will demonstrate how to use OBS through the WebUI and the command-line client osc.
ja: 次のセクションでは、WebUI とコマンドライン クライアント osc を用いた OBS の使用方法について説明します。

source: Cooperate With OSRB
ja: OSRB と協力する

source: - Rules to follow when using libraries to avoid linkages issues that might arise
ja: リンク問題が発生しうるライブラリを使用する際に従うべきルール

source: LGPL v3 or later license notice found in file
ja: ファイルには LGPL v3 以降のライセンス告知がある

source: A two-day comprehensive coverage of the compliance process, including working sessions with the compliance team on how to adapt compliance activities to the organization's needs.
ja: ◆◆コンプライアンス プロセスを包括的に説明する 2 日間のコース。コンプライアンス作業を各組織のニーズにどう適応させるかというテーマで、コンプライアンス チームとワーキング セッションも行います。たとえば、以下のようなホワイト ペーパーがあります。The Basics You Must Know”Challenges and Solutions”

source: For software components received from a third party software provider, this includes the licensing agreement.
ja: サード パーティ ソフトウェア プロバイダーから受け取ったソフトウェア コンポーネントの場合には、ライセンス契約書も提供します。

source: - Scan source code for possible matches with FOSS
ja: FOSS と一致するソース コードがあるかどうかスキャンする

source: Verifications
ja: 検証

source: It has proven to be very helpful when Legal provided such sheets for FOSS licenses that describe very briefly for each license, the license grant, the limitations and obligations.
ja: 各ライセンスの許可、制約、義務を端的に解説した「FOSS ライセンス シート」が法律顧問から提供されることは、コンプライアンス活動にとって極めて有用であることが証明されています。

source: The MeeGo OBS build farm is hosted by The Linux Foundation at Oregon State University.
ja: MeeGo OBS ビルド ファームは、The Linux Foundation がオレゴン州立大学で運営しています。

source: Open Source Compliance Programs: What You Must Know
ja: オープン ソース コンプライアンス プログラム: 基本概念

source: OBS supports both and other formats such as simple tarballs are possible too.
ja: OBS は、この両方の形式のほかに、シンプルな tar 形式などもサポートしています。

source: - Perform audits on all software included in the product which involves the following tasks:
ja: - 製品に含まれるすべてのソフトウェアの監査を行う。以下のような処理が含まれる。

source: The Self-Assessment Checklist can be used to stimulate discussion about the rigor and effectiveness of a compliance program and to focus attention on areas of greatest need for improvement.
ja: この自己診断チェックリストは、コンプライアンス プログラムの厳格さや効果について議論を促したい場合や、最も改善が必要な領域に注目を集めたい場合に使用できます。

source: Prerequisites
ja: 前提条件

source: Consequently all Packages depend on the toolchain for build and a change in the toolchain will automatically trigger the rebuild of all other Packages.
ja: そのため、すべてのパッケージはビルド用のツールチェーンに依存し、ツールチェーンが変更されると、自動的に他のすべてのパッケージがリビルドされます。

source: As mentioned earlier, the Legal Counsel provide advice on license compatibility issues.
ja: 繰り返しますが、法律顧問はライセンスの両立性に関する助言も行います。

source: Open Compliance Training Courses
ja: オープン コンプライアンス トレーニング コース

source: Open Source Executive Committee
ja: オープン ソース実行委員会

source: While local build environments using IDEs, scripts, etc. are suitable for single developers and possibly for small engineering workgroups demands quickly extend beyond the capabilities of such solutions when integration with other parts of the organization and defined interfaces for handing off deliverables are required.
ja: IDE やスクリプトなどを使用したローカル ビルド環境は、シングル デベロッパーや小規模の技術ワークグループに適しているかもしれません。しかし、組織内の他の部分との統合が必要になったり、成果物を引き渡すための定義済みインタフェースが必要になったりすると、こうしたビルド環境のソリューション能力では、あっと言う間に需要に追い付けなくなります。

source: Skilled and knowledgeable individuals are made available to contribute to the compliance effort.
ja: ことスキルと知識を持つ人材が、コンプライアンス活動への貢献に参加可能であること。

source: The goal of providing FOSS and compliance training is to raise awareness of FOSS policies and strategies and to build a common understanding around the issues and facts of FOSS licensing and the business and legal risks of incorporating FOSS in products.
ja: FOSS およびコンプライアンスのトレーニングを実施する目的は、FOSS のポリシーや戦略への認識を高め、FOSS ライセンスの問題や事実、および製品に FOSS を組み込む場合のビジネス リスクやリーガル リスクについて、共通の理解を得るためです。

source: Free and Open Source Software Compliance: The Basics You Must Know
ja: フリー & オープン ソース ソフトウェア コンプライアンス: 基本概念

source: Supply Chain
ja: サプライ チェーン

source: Embedded Linux Development with Yocto Project / OpenEmbedded
ja: Embedded Linux Development with Yocto Project / OpenEmbedded (Yocto Project / OpenEmbedded による組込み Linux 開発)

source: Figure 4 presents the individuals and teams responsible for achieving FOSS compliance.
ja: 図 4 は、FOSS コンプライアンスを遂行する責任を負うチームの構成例を表しています。

source: Program Description
ja: プログラムの説明

source: This white paper is a first in a series that will focus on the various practical aspects of ensuring free and open source software (FOSS) compliance in the enterprise.
ja: このホワイトペーパーは、企業におけるフリー & オープン ソース ソフトウェア (FOSS) のコンプライアンス (法令・契約などの順守) を実行する実務的側面に重点を置いたシリーズの第一弾です。

source: Sample text for use in promoting the Mini-Workshop on Open Compliance at LinuxCon Japan 2010:
ja: <LinuxCon Japan 2010 におけるオープン コンプライアンスのミニワークショップ販促用サンプル テキスト>

source: There are many features of the Linux kernel that are highly relevant to embedded systems.
ja: Linux カーネルには、組込みシステムに関連するさまざまな機能があります。

source: The industry practice is to keep FOSS licenses in their native language.
ja: 業界の慣行では、FOSS ライセンスは母国語のままです。

source: The OBS repositories track changes on the Package level only.
ja: OBS リポジトリは、パッケージ レベルでのみ変更を追跡します。

source: This automation allows the OSRB to manage all "paper work" related to compliance electronically.
ja: この自動化により、OSRB はコンプライアンスに関するあらゆる「ペーパーワーク」を電子的に管理できます。

source: Improve
ja: 改善

source: As you can see, there are tons of ways to dive into embedded Linux.
ja: このように、組込み Linux の学習方法はいろいろあります。

source: Company contributions to open source communities are tracked (e.g. both individual contributions such as bug fixes as well as companysponsored projects).
ja: オープン ソース コミュニティへの企業貢献を追跡すること (バグ修正のような個人の貢献と、企業が支援するプロジェクトの両方が対象)。

source: Ibrahim Haddad is Director of Technology and Alliances at the Linux Foundation focusing on Mobile Linux initiatives and advancing the Linux platform for next-generation mobile computing devices.
ja: Ibrahim Haddad は Linux Foundation のテクニカル アライアンス担当ディレクターで、モバイル Linux にフォーカスし、次世代モバイル コンピューター機器向けの Linux プラットフォームを推進しています。

source: The detailed responsibilities of the OSRB include:
ja: OSRB の責任の詳細は、以下のとおりです。

source: Reviewers of the compliance ticket and their roles and responsibilities
ja: コンプライアンス チケットの調査担当者とその役割および責任

source: We will be discussing the topic of implementing a company-wide compliance program in a future paper.
ja: 企業単位のコンプライアンス プログラムの実装については、今後公開するホワイトペーパーで説明する予定です。

source: Company to appoint a compliance officer to monitor and ensure GPL compliance
ja: 企業はコンプライアンス オフィサーを採用し、GPL コンプライアンスの監視および保証を行う

source: Local builds are supported on most common Linux distributions such as Debian, Fedora, MeeGo, openSUSE, and Ubuntu.
ja: ローカル ビルドは、Debian、Fedora、MeeGo、OpenSUSE、Ubuntu などの一般的な Linux ディストリビューションでサポートされています。

source: - Follow technical compliance guidelines
ja: 技術的なコンプライアンス ガイドラインを順守する

source: We have witnessed on several occasions FOSS projects changing licenses in between versions, hence the importance of going through the process again.
ja: FOSS プロジェクトは、バージョンによってライセンスを変更することがあるため、同じプロセスを経て承認を受けることが重要です。

source: FOSS, developed by members of the FOSS community.
ja: 3 つ目は FOSS ソフトウェアです。FOSS コミュニティのメンバーによって開発されたものです。

source: Verifications that the source code is:
ja: ソース コードについて、以下の確認を行う。

source: Some companies have opted for a centralized team (Open Source Program Office) lead by an individual who has engineering, legal and operational experience.
ja: エンジニアリング、法務、運用などの経験を兼ね備えた人物が率いる集中型チーム (オープン ソース プログラム オフィス) を作る企業もあれば、

source: Independent audit
ja: 独立監査の実績

source: Key Linux Protection Activities Include:
ja: 主な Linux 保護活動:

source: In addition, the Linux Foundation has created a number of tools to assist companies in their due diligence activities.
ja: また、Linux Foundation では、企業による精査作業を支援する各種ツールを開発しました。

source: Some embedded distributions are built for specific devices.
ja: 特定デバイス向けの組込みディストリビューションもあります。

source: Free and Open Source Software Compliance: Who Does What
ja: フリー & オープン ソース ソフトウェア コンプライアンス: 誰が何をするか

source: There is a clear separation between the different components and their providers
ja: 各コンポーネントとその提供者が明確に分離している

source: These systems then potentially define a worker's capabilities.
ja: ワーカーが設置されたシステムによって、その後、ワーカーの性能が確定される可能性があります。

source: The development on this tool will start in q4 2010 and links to mailing list and git repository will be made available then.
ja: このツールの開発は、2010 年後半に開始し、その後メーリング リストと git リポジトリへのリンクが有効になる予定です。

source: - Coordinates source code scans and drive all auditing issues to closure
ja: ソース コード スキャン処理を調整し、あらゆる監査問題の終結を図る

source: Formal Training
ja: 公式のトレーニング

source: - Contribute to creating compliance training
ja: コンプライアンス プログラムの開発に貢献する

source: Final Commercial Product4
ja: 最終的な商品

source: Declared License(s)
ja: 宣言されているライセンス

source: - FOSS component added to the organization’s source code repository that does not correspond to an incoming request to use FOSS: Relying on engineers to fill out forms announcing their intent to use FOSS is not always a reliable method.
ja: -ソース コード リポジトリに追加されている FOSS コンポーネントが、受け付けた FOSS 使用リクエストに対応していない。 FOSS 使用要求フォームへの入力をエンジニアに頼るのは、確実な方法とは言えません。

source: Staffing and resources for the compliance program
ja: コンプライアンス プログラムのための人材配置とリソース

source: A source code peer review tool to review the changes introduced to the original source code before it gets published as part of meeting license obligations
ja: オリジナルのソース コードに加えられた変更を、ライセンス義務に従って公開する際、公開前にレビューするためのソース コード ピア レビュー ツール

source: Getting Started with MeeGo OBS
ja: MeeGo OBS の開始

source: The Linux Foundation offers many training courses around Linux: http://training.linuxfoundation.org/.
ja: The Linux Foundation では、Linux に関するさまざまなトレーニング コース <http://training.linuxfoundation.org/> を提供しています。

source: We also work closely with our members and the community on initiatives to ensure Linux is protected.
ja: また、確実に Linux を保護するために、メンバーとコミュニティが密接に連携しています。

source: - Flag dependencies, code matches and licensing conflicts
ja: 依存関係の状態、コードの一致、およびライセンス準拠違反を指摘する

source: If they identify a dependency resulting in a licensing conflict, the OSRB Chair will issue ticket to Engineering to resolve the dependency problem by reworking the source code.
ja: ライセンス違反につながる依存関係が見つかった場合、OSRB チェアは、ソース コードを改変して依存関係の問題を解決するように、エンジニアリング部門に対してチケットを発行します。

source: Corporate policy on open source: What should be covered?
ja: オープン ソースに関する企業ポリシー: 何をカバーするべきか?

source: Mitigate risks through architecture design and engineering practices
ja: アーキテクチャ設計とエンジニアリング プラクティスによりリスクを低減する

source: Patches can be built and tested against Packages from multiple Projects.
ja: 複数のプロジェクトのパッケージに対して、パッチをビルドし、テストできます。

source: As such, on their first day, new employees would receive a 30 minutes training on FOSS and compliance.
ja: 同じく入社初日に、新入社員は FOSS とコンプライアンスに関する 30 分程度のトレーニングを受講します。

source: The result of the architecture review is an analysis of the licensing obligations that may extend from the FOSS to the proprietary or third party components.
ja: アーキテクチャ レビューの結果により、FOSS からプロプライエタリ コンポーネントやサード パーティ コンポーネントにライセンス義務が拡張する可能性があるかどうかが解析されます。

source: Distributing any applicable software components and making available applicable notices
ja: 適用されるすべてのソフトウェア コンポーネントを配布し、適用される告知を有効にする

source: Those teams further down the road can use the checklist to gauge their progress in implementing a compliance process and guide them in setting process improvement priorities.
ja: コンプライアンス プログラムについて経験を積んでいるチームは、このチェックリストを使用してコンプライアンス プロセス実装の進行状態を評価でき、プロセス改善活動の優先順位を設定する際に役立ちます。

source: Fortunately, FOSS is an alive and active project so these items will hopefully be addressed in a future version.
ja: 幸い、FOSSology は現存するアクティブなプロジェクトであるため、これらの問題は今後のバージョンで解決されるでしょう。

source: Approvals as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「承認」ステップ

source: Failure to Comply
ja: コンプライアンス違反

source: Any corporation that uses and/or distributes software packages has a stake in the outcome.
ja: ソフトウェア パッケージを使用したり、配布したりするすべての企業が、その成果に関心を持っています。

source: For companies using FOSS in their commercial products, it is recommended to create and maintain a good relationship with the FOSS community.
ja: 自社の商品に FOSS を使用している企業は、FOSS コミュニティとの良好な関係を構築し、維持することをお勧めします。

source: Demonstration of the buckets concept
ja: バケットの概念のデモ

source: - It enables organizations to benefit from FOSS while complying with obligations
ja: 組織は義務を履行すると同時に FOSS のメリットを受けることができる

source: Companies ensure contractual protection through their commercial contracts and licenses
ja: 企業は契約と商用ライセンスにより、法的防御を保証する

source: Check out the resources that the Linux Foundation is making available ranging from professional training to tools and everything in between.
ja: プロフェッショナル トレーニングやツールをはじめ、The Linux Foundation が提供するさまざまなリソースをぜひチェックしてみてください。

source: There are various approaches that can help overcome this challenge and assist in the creation of a lightweight program that is not seen as a burden to the development activities.
ja: この問題を克服して、開発活動の負担にならないコンパクトなプログラムの作成を助ける方法がいくつかあります。

source: FOSS Compliance
ja: FOSS コンプライアンス

source: The Linux Foundation welcomes all interested companies to participate at http://www.FOSSBazaar.org.
ja: この取り組みへの参加については、下記をご覧ください。http://www.FOSSBazaar.org

source: The UEFI specification (section 27.7.1) even allows for the revocation of KEKs should the original authorised user have lost control of them, which is all the necessary machinery you need to operate a fully functional CA.
ja: UEFI 仕様 (セクション 27.7.1) では、本来のユーザーが鍵交換鍵を制御できなくなった場合には、鍵のリボーク (取り消し) を行うことを許可しており、十分に機能する認証局の運用には不可欠なしくみです。
